pages/guilda-ia/11-apresentacoes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="pt_BR" xml:lang="pt_BR">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Apresentação Final - Showcase</title>
<meta name="author" content="Lucas S. Vieira" />
<meta name="description" content="Material didático do curso de IA Generativa da Guilda de IA
Semana 12 - Guilda de IA: Apresentação final dos agentes desenvolvidos" />
<meta name="generator" content="Org Mode" />
<!-- Google tag (gtag.js) -->
<link rel="stylesheet" type="text/css" href="/css/main.css" />
<link rel="stylesheet" type="text/css" href="/css/syntax.css" />
<link id="theme-css" rel="stylesheet" type="text/css" href="/css/dark-theme.css" />
<link rel="icon" type="image/jpg" href="/img/cat-i-mage.jpg" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta name="theme-color" content="#14171e">
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.4.0/css/all.min.css">
<meta property="og:url" content="https://luksamuk.codes/pages/guilda-ia/11-apresentacoes.html">
<meta property="og:type" content="website">
<meta property="og:title" content="Apresentação Final - Showcase">
<meta property="og:description" content="Material didático do curso de IA Generativa da Guilda de IA
Semana 12 - Guilda de IA: Apresentação final dos agentes desenvolvidos">
<meta property="og:image" content="https://luksamuk.codes/img/banner-full.png">
<meta name="twitter:card" content="summary_large_image">
<meta name="twitter:domain" content="luksamuk.codes">
<meta name="twitter:url" content="https://luksamuk.codes/pages/guilda-ia/11-apresentacoes.html">
<meta name="twitter:title" content="Apresentação Final - Showcase">
<meta name="twitter:description" content="Material didático do curso de IA Generativa da Guilda de IA
Semana 12 - Guilda de IA: Apresentação final dos agentes desenvolvidos">
<meta name="twitter:image" content="https://luksamuk.codes/img/banner.png">
</head>
<body>
<div id="preamble" class="status">
<div id="nav-wrapper"><nav id="site-nav"><a href="/"><i class="fa-solid fa-house"></i> Home</a> <a href="/pages/about.html"><i class="fa-solid fa-user"></i> About</a> <a href="/pages/games.html"><i class="fa-solid fa-gamepad"></i> Games</a> <a href="/pages/portfolio.html"><i class="fa-solid fa-briefcase"></i> Portfolio</a> <a href="/pages/learn.html"><i class="fa-solid fa-book-open"></i> Learn</a> <a href="/pages/talks-index.html"><i class="fa-solid fa-chalkboard-user"></i> Talks</a> <a href="/pages/blog.html"><i class="fa-solid fa-rss"></i> Blog</a> <button id="theme-selector" onclick="toggleTheme()"><i class="fa-solid fa-moon"></i></button></nav><h1 class="site-title"><a href="/">The Alchemist's Hideout</a></h1></div><h1 class="title">Apresentação Final - Showcase</h1>
</div>
<div id="content" class="content">
<div id="outline-container-org00579d8" class="outline-2">
<h2 id="org00579d8">Semana 12 - Apresentação Final</h2>
</div>

<div id="outline-container-org2ea2c78" class="outline-2">
<h2 id="org2ea2c78">Parabéns!</h2>
<div class="outline-text-2" id="text-org2ea2c78">
<p>
Você chegou ao fim da Guilda de IA!
</p>

<p>
<b><b>O que você aprendeu:</b></b>
</p>
<ul class="org-ul">
<li>Semana 1: O que é IA hoje? (nomenclaturas)</li>
<li>Semana 2: Prompting básico</li>
<li>Semana 3-4: Python (mínimo e intermediário)</li>
<li>Semana 5: Estrutura de agente</li>
<li>Semana 6: Primeira ferramenta</li>
<li>Semana 7: Múltiplas ferramentas</li>
<li>Semana 8: Embeddings e similaridade</li>
<li>Semana 9: RAG</li>
<li>Semana 10: Desenvolvimento livre</li>
</ul>
</div>
</div>
<div id="outline-container-org7ce8c57" class="outline-2">
<h2 id="org7ce8c57">Formato da apresentação</h2>
<div class="outline-text-2" id="text-org7ce8c57">
<p>
<b><b>Cada aluno tem 2-3 minutos:</b></b>
</p>
<ul class="org-ul">
<li>Mostre o agente funcionando</li>
<li>Explique uma decisão que você tomou</li>
<li>Compartilhe uma dificuldade superada</li>
<li>(Opcional) Mostre algo que você adicionou</li>
</ul>

<p>
<b><b>Não precisa ser perfeito!</b></b>
</p>

<p>
O objetivo é <b>aprender e compartilhar</b>, não impressionar.
</p>
</div>
</div>
<div id="outline-container-orgbe7eeb1" class="outline-2">
<h2 id="orgbe7eeb1">Checklist antes de apresentar</h2>
<div class="outline-text-2" id="text-orgbe7eeb1">
<p>
<b><b>Funciona:</b></b>
</p>
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Agente responde perguntas básicas</li>
<li class="off"><code>[&#xa0;]</code> Ferramenta está funcionando</li>
<li class="off"><code>[&#xa0;]</code> Personalidade está clara</li>
</ul>

<p>
<b><b>Preparado:</b></b>
</p>
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Testei algumas perguntas</li>
<li class="off"><code>[&#xa0;]</code> Sei explicar o que fiz</li>
<li class="off"><code>[&#xa0;]</code> Tenho uma dificuldade para compartilhar</li>
</ul>
</div>
</div>
<div id="outline-container-org2673614" class="outline-2">
<h2 id="org2673614">Rubrica de avaliação</h2>
<div class="outline-text-2" id="text-org2673614">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Critério</th>
<th scope="col" class="org-right">Pontos</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Agente funcional</td>
<td class="org-right">40</td>
</tr>

<tr>
<td class="org-left">Explicação clara</td>
<td class="org-right">30</td>
</tr>

<tr>
<td class="org-left">Dificuldade superada</td>
<td class="org-right">20</td>
</tr>

<tr>
<td class="org-left">Criatividade</td>
<td class="org-right">10</td>
</tr>
</tbody>
</table>

<p>
<b><b>Nota:</b></b> Não é sobre ter o melhor agente. É sobre mostrar que aprendeu.
</p>
</div>
</div>
<div id="outline-container-orgbe74877" class="outline-2">
<h2 id="orgbe74877">Para quem terminou cedo</h2>
<div class="outline-text-2" id="text-orgbe74877">
<p>
Se seu agente está funcionando e você quer mais:
</p>

<p>
<b><b>Ideias de extensão:</b></b>
</p>
<ul class="org-ul">
<li>Adicionar outra ferramenta</li>
<li>Melhorar a personalidade</li>
<li>Implementar RAG (se não fez)</li>
<li>Testar com mais casos</li>
</ul>
</div>
</div>
<div id="outline-container-orgc35da62" class="outline-2">
<h2 id="orgc35da62">O que vem depois?</h2>
<div class="outline-text-2" id="text-orgc35da62">
<ul class="org-ul">
<li>Continue explorando</li>
<li>Participe de outras guildas</li>
<li>Construa projetos pessoais</li>
<li>Compartilhe conhecimento</li>
</ul>

<p>
<b><b>A IA está transformando o mundo — e você agora faz parte dessa transformação.</b></b>
</p>
</div>
</div>
<div id="outline-container-orgeeb1e5f" class="outline-2">
<h2 id="orgeeb1e5f">Obrigado por participar!</h2>
<div class="outline-text-2" id="text-orgeeb1e5f">
<p>
Continue criando, explorando e aprendendo.</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<h3><a href="/pages/guilda-ia/">&#8592; Voltar para Guilda de IA</a></h3>
</div>
</body>
</html>
